Revit 2024 API
Tile.TileRandomSeed Property
 The property labeled "Randomize" from the "Tile" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string TileRandomSeed { get; }
Visual Basic
Public Shared ReadOnly Property TileRandomSeed As String
	Get
Visual C++
public:
static property String^ TileRandomSeed {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with a minimum of "0".
See Also
Tile Class
Autodesk.Revit.DB.Visual Namespace